# Divide DFs for both versions, keeping visitor and visit ids, changing 'gender' column values.

In [74]:
import pandas as pd

In [75]:
# import reusable functions from utils directory
import sys
sys.path.append('../../utils')
import functions

In [76]:
combined_cleaned_df = pd.read_csv('../../data/clean/combined_cleaned_data.csv')
combined_cleaned_df.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [77]:
merged_demo_experiment_df = pd.read_csv('./final_demo_df_clean.csv')
merged_demo_experiment_df

,client_id,client_tenure_years,client_tenure_months,client_age,gender,num_accounts,balance,calls_last_6_months,logons_last_6_months
0,836976,6,73,60,Unspecified,2,45105.30,6,9
1,2304905,7,94,58,Unspecified,2,110860.30,6,9
2,1439522,5,64,32,Unspecified,2,52467.79,6,9
3,1562045,16,198,49,Male,2,67454.65,3,6
4,5126305,12,145,33,Female,2,103671.75,0,3
...,...,...,...,...,...,...,...,...,...
70589,7993686,4,56,38,Unspecified,3,1411062.68,5,5
70590,8981690,12,148,31,Male,2,101867.07,6,6
70591,333913,16,198,61,Female,2,40745.00,3,3
70592,1573142,21,255,68,Male,3,475114.69,4,4
70593,5602139,21,254,59,Female,3,157498.73,7,7

In [78]:
merged_client_df = pd.merge(combined_cleaned_df, merged_demo_experiment_df, on='client_id', how='left')

In [79]:

merged_client_df.rename(columns={'process_step' : 'step', 'client_tenure_years': 'tenure_years', 'client_tenure_months': 'tenure_months', 'client_age' : 'age', 'num_accounts' : 'accounts'}, inplace=True)
functions.floats_to_ints(merged_client_df, 'tenure_years')
functions.floats_to_ints(merged_client_df, 'tenure_months')
functions.floats_to_ints(merged_client_df, 'age')
functions.floats_to_ints(merged_client_df, 'accounts')
functions.floats_to_ints(merged_client_df, 'calls_last_6_months')
functions.floats_to_ints(merged_client_df, 'logons_last_6_months')



merged_client_df

,client_id,visitor_id,visit_id,step,date_time,tenure_years,tenure_months,age,gender,accounts,balance,calls_last_6_months,logons_last_6_months
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07,5,64,79,Unspecified,2,189023.86,1,4
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51,5,64,79,Unspecified,2,189023.86,1,4
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22,5,64,79,Unspecified,2,189023.86,1,4
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13,5,64,79,Unspecified,2,189023.86,1,4
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04,5,64,79,Unspecified,2,189023.86,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
744636,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:46:10,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744637,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:45:29,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744638,9668240,388766751_9038881013,922267647_3096648104_968866,step_1,2017-05-24 18:44:51,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744639,9668240,388766751_9038881013,922267647_3096648104_968866,start,2017-05-24 18:44:34,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744640,674799,947159805_81558194550,86152093_47511127657_716022,start,2017-06-03 12:17:09,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>

In [80]:
replacement_dict_steps = {
    'start' : 0,
    'step_1' : 1,
    'step_2' : 2,
    'step_3' : 3,
    'confirm' : 4
}

merged_client_df['step'] = merged_client_df['step'].map(replacement_dict_steps)

merged_client_df

,client_id,visitor_id,visit_id,step,date_time,tenure_years,tenure_months,age,gender,accounts,balance,calls_last_6_months,logons_last_6_months
0,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:27:07,5,64,79,Unspecified,2,189023.86,1,4
1,9988021,580560515_7732621733,781255054_21935453173_531117,2,2017-04-17 15:26:51,5,64,79,Unspecified,2,189023.86,1,4
2,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:19:22,5,64,79,Unspecified,2,189023.86,1,4
3,9988021,580560515_7732621733,781255054_21935453173_531117,2,2017-04-17 15:19:13,5,64,79,Unspecified,2,189023.86,1,4
4,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:18:04,5,64,79,Unspecified,2,189023.86,1,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
744636,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:46:10,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744637,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:45:29,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744638,9668240,388766751_9038881013,922267647_3096648104_968866,1,2017-05-24 18:44:51,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744639,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:44:34,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>
744640,674799,947159805_81558194550,86152093_47511127657_716022,0,2017-06-03 12:17:09,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>

# Add Error Rate Column

In [81]:
# Detect backward steps (errors) for all clients
merged_client_df['stepped_back'] = merged_client_df.groupby('client_id')['step'].diff() < 0

# Count the number of unique clients who experienced at least one error
clients_with_errors = merged_client_df[merged_client_df['stepped_back']]['client_id'].nunique()

# Count the total number of errors for each client
errors_per_client = merged_client_df[merged_client_df['stepped_back']].groupby('client_id').size()

# Total number of errors across all clients
total_errors = merged_client_df['stepped_back'].sum()

print(f'Number of clients with at least one error: {clients_with_errors}')
print('Errors per client:')
print(errors_per_client)
print(f'Total number of errors across all clients: {total_errors}')

Number of clients with at least one error: 105082
Errors per client:
client_id
169        4
546        4
555        4
647        4
722        6
          ..
9999729    7
9999768    7
9999832    1
9999839    4
9999875    4
Length: 105082, dtype: int64
Total number of errors across all clients: 446362

In [82]:
# add column 'error_count'
merged_client_df['error_count'] = merged_client_df['client_id'].map(errors_per_client).fillna(0).astype(int)

In [83]:
merged_client_df

,client_id,visitor_id,visit_id,step,date_time,tenure_years,tenure_months,age,gender,accounts,balance,calls_last_6_months,logons_last_6_months,stepped_back,error_count
0,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:27:07,5,64,79,Unspecified,2,189023.86,1,4,False,5
1,9988021,580560515_7732621733,781255054_21935453173_531117,2,2017-04-17 15:26:51,5,64,79,Unspecified,2,189023.86,1,4,True,5
2,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:19:22,5,64,79,Unspecified,2,189023.86,1,4,False,5
3,9988021,580560515_7732621733,781255054_21935453173_531117,2,2017-04-17 15:19:13,5,64,79,Unspecified,2,189023.86,1,4,True,5
4,9988021,580560515_7732621733,781255054_21935453173_531117,3,2017-04-17 15:18:04,5,64,79,Unspecified,2,189023.86,1,4,False,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
744636,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:46:10,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>,True,12
744637,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:45:29,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>,False,12
744638,9668240,388766751_9038881013,922267647_3096648104_968866,1,2017-05-24 18:44:51,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>,False,12
744639,9668240,388766751_9038881013,922267647_3096648104_968866,0,2017-05-24 18:44:34,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>,True,12
744640,674799,947159805_81558194550,86152093_47511127657_716022,0,2017-06-03 12:17:09,<NA>,<NA>,<NA>,NaN,<NA>,NaN,<NA>,<NA>,False,0

In [84]:
functions.check_unique_and_empty(merged_client_df)

Summary of Unique and Empty Values:

                      Unique value count  Empty value count
Column
client_id                         120157                  0
visitor_id                        130236                  0
visit_id                          158095                  0
step                                   5                  0
date_time                         629363                  0
tenure_years                          54             300869
tenure_months                        482             300869
age                                   84             300869
gender                                 4             300869
accounts                               8             300869
balance                            70326             300869
calls_last_6_months                    8             300869
logons_last_6_months                   9             300869
stepped_back                           2                  0
error_count                           36                  0

--------------------------------------------------

In [85]:
merged_final_demo_final_experiment_clients_df = pd.read_csv('../../data/clean/merged_final_demo_final_experiment_clients_df.csv')
merged_final_demo_final_experiment_clients_df

,client_id,client_tenure_years,client_tenure_months,client_age,gender,num_accounts,balance,calls_last_6_months,logons_last_6_months,variation
0,836976,6,73,60,Unspecified,2,45105.30,6,9,Test
1,2304905,7,94,58,Unspecified,2,110860.30,6,9,Control
2,1439522,5,64,32,Unspecified,2,52467.79,6,9,Test
3,1562045,16,198,49,Male,2,67454.65,3,6,Test
4,5126305,12,145,33,Female,2,103671.75,0,3,Control
...,...,...,...,...,...,...,...,...,...,...
70589,7993686,4,56,38,Unspecified,3,1411062.68,5,5,Unknown
70590,8981690,12,148,31,Male,2,101867.07,6,6,Unknown
70591,333913,16,198,61,Female,2,40745.00,3,3,Unknown
70592,1573142,21,255,68,Male,3,475114.69,4,4,Unknown
70593,5602139,21,254,59,Female,3,157498.73,7,7,Unknown

In [86]:
# Merge the DataFrames using 'outer' join to keep all records
merged_client_df = pd.merge(
    merged_client_df, 
    merged_final_demo_final_experiment_clients_df, 
    on='client_id', 
    how='outer', 
    suffixes=('', '_merged')  # Use suffixes to handle columns with the same name
)

# Drop columns that are duplicates
merged_client_df = merged_client_df.loc[:, ~merged_client_df.columns.duplicated()]

In [87]:
print(merged_client_df['variation'].unique())

['Unknown' nan 'Test' 'Control']

In [88]:
merged_client_df.dropna(axis=0, how='any', inplace=True)
# Drop unwanted columns (choose the version you want to keep)
# merged_client_df.drop(columns=['gender_x', 'gender_y', 'calls_last_6_months_x', 'calls_last_6_months_y', 'logons_last_6_months_x', 'logons_last_6_months_y'], inplace=True)
merged_client_df.drop(columns=['gender_merged', 'balance_merged' , 'calls_last_6_months_merged', 'logons_last_6_months_merged'], inplace=True)

functions.check_unique_and_empty(merged_client_df)

Summary of Unique and Empty Values:

                      Unique value count  Empty value count
Column
client_id                          70594                  0
visitor_id                         78168                  0
visit_id                           96749                  0
step                                   5                  0
date_time                         383945                  0
tenure_years                          54                  0
tenure_months                        482                  0
age                                   84                  0
gender                                 4                  0
accounts                               8                  0
balance                            70326                  0
calls_last_6_months                    8                  0
logons_last_6_months                   9                  0
stepped_back                           2                  0
error_count                           34                  0
client_tenure_years                   54                  0
client_tenure_months                 482                  0
client_age                            84                  0
num_accounts                           8                  0
variation                              3                  0

--------------------------------------------------

In [89]:
# reorder columns
# df = df[['client_id', 'client_id', 'variation']]
merged_client_df.to_csv('final_clean_client_df.csv', index=False)

In [90]:
control_variation_df = merged_client_df[merged_client_df['variation'] == 'Control']
test_variation_df = merged_client_df[merged_client_df['variation'] == 'Test']
unknown_variation_df = merged_client_df[merged_client_df['variation'] == 'Unknown']

# Print the resulting DataFrames
print("Control DataFrame:")
print(control_variation_df)

print("\nTest DataFrame:")
print(test_variation_df)

print("\nUnknown DataFrame:")
print(unknown_variation_df)

Control DataFrame:
        client_id             visitor_id                      visit_id  step  \
57           1028   42237450_62128060588  557292053_87239438319_391157     1
58           1028   42237450_62128060588  557292053_87239438319_391157     2
59           1028   42237450_62128060588  557292053_87239438319_391157     1
60           1028   42237450_62128060588  557292053_87239438319_391157     1
61           1028   42237450_62128060588  557292053_87239438319_391157     3
...           ...                    ...                           ...   ...
744508    9998346  292425655_16607136645  189177304_69869411700_783154     2
744509    9998346  292425655_16607136645  189177304_69869411700_783154     2
744510    9998346  292425655_16607136645  189177304_69869411700_783154     1
744511    9998346  292425655_16607136645  189177304_69869411700_783154     0
744562    9998921  960034051_85687824805    378424178_59565976155_8051     0

                  date_time  tenure_years  tenure_months  age  gender  \
57      2017-04-08 19:00:26            12            145   36    Male
58      2017-04-08 19:00:17            12            145   36    Male
59      2017-04-08 19:00:15            12            145   36    Male
60      2017-04-08 18:59:55            12            145   36    Male
61      2017-04-08 18:58:04            12            145   36    Male
...                     ...           ...            ...  ...     ...
744508  2017-03-29 15:27:40            50            602   61  Female
744509  2017-03-29 15:26:47            50            602   61  Female
744510  2017-03-29 15:26:02            50            602   61  Female
744511  2017-03-29 15:25:00            50            602   61  Female
744562  2017-04-18 11:26:31            15            189   38  Female

        accounts    balance  calls_last_6_months  logons_last_6_months  \
57             3  103520.22                    1                     4
58             3  103520.22                    1                     4
59             3  103520.22                    1                     4
60             3  103520.22                    1                     4
61             3  103520.22                    1                     4
...          ...        ...                  ...                   ...
744508         2  149881.38                    6                     9
744509         2  149881.38                    6                     9
744510         2  149881.38                    6                     9
744511         2  149881.38                    6                     9
744562         2   30644.10                    4                     7

        stepped_back  error_count  client_tenure_years  client_tenure_months  \
57             False            4                 12.0                 145.0
58             False            4                 12.0                 145.0
59              True            4                 12.0                 145.0
60             False            4                 12.0                 145.0
61             False            4                 12.0                 145.0
...              ...          ...                  ...                   ...
744508         False            6                 50.0                 602.0
744509         False            6                 50.0                 602.0
744510          True            6                 50.0                 602.0
744511          True            6                 50.0                 602.0
744562         False            0                 15.0                 189.0

        client_age  num_accounts variation
57            36.0           3.0   Control
58            36.0           3.0   Control
59            36.0           3.0   Control
60            36.0           3.0   Control
61            36.0           3.0   Control
...            ...           ...       ...
744508        61.0           2.0   Control
744509        61.0           2.0   Control
744510        61.0           2.0   Control
744511        61.0           2.0   Control
744562        38.0           2.0   Control

[140482 rows x 20 columns]

Test DataFrame:
        client_id             visitor_id                      visit_id  step  \
12            555  402506806_56087378777  637149525_38041617439_716659     4
13            555  402506806_56087378777  637149525_38041617439_716659     3
14            555  402506806_56087378777  637149525_38041617439_716659     2
15            555  402506806_56087378777  637149525_38041617439_716659     1
16            555  402506806_56087378777  637149525_38041617439_716659     0
...           ...                    ...                           ...   ...
744612    9999729  834634258_21862004160  870243567_56915814033_814203     2
744613    9999729  834634258_21862004160  870243567_56915814033_814203     1
744614    9999729  834634258_21862004160  870243567_56915814033_814203     0
744627    9999832  145538019_54444341400  472154369_16714624241_585315     1
744628    9999832  145538019_54444341400  472154369_16714624241_585315     0

                  date_time  tenure_years  tenure_months  age       gender  \
12      2017-04-15 13:00:34             3             46   29  Unspecified
13      2017-04-15 13:00:14             3             46   29  Unspecified
14      2017-04-15 12:58:35             3             46   29  Unspecified
15      2017-04-15 12:58:03             3             46   29  Unspecified
16      2017-04-15 12:57:56             3             46   29  Unspecified
...                     ...           ...            ...  ...          ...
744612  2017-05-08 16:08:40            10            124   31       Female
744613  2017-05-08 16:08:30            10            124   31       Female
744614  2017-05-08 16:08:25            10            124   31       Female
744627  2017-05-16 16:46:11            23            281   49       Female
744628  2017-05-16 16:46:03            23            281   49       Female

        accounts    balance  calls_last_6_months  logons_last_6_months  \
12             2   25454.66                    2                     6
13             2   25454.66                    2                     6
14             2   25454.66                    2                     6
15             2   25454.66                    2                     6
16             2   25454.66                    2                     6
...          ...        ...                  ...                   ...
744612         3  107059.74                    6                     9
744613         3  107059.74                    6                     9
744614         3  107059.74                    6                     9
744627         2  431887.61                    1                     4
744628         2  431887.61                    1                     4

        stepped_back  error_count  client_tenure_years  client_tenure_months  \
12             False            4                  3.0                  46.0
13              True            4                  3.0                  46.0
14              True            4                  3.0                  46.0
15              True            4                  3.0                  46.0
16              True            4                  3.0                  46.0
...              ...          ...                  ...                   ...
744612          True            7                 10.0                 124.0
744613          True            7                 10.0                 124.0
744614          True            7                 10.0                 124.0
744627         False            1                 23.0                 281.0
744628          True            1                 23.0                 281.0

        client_age  num_accounts variation
12            29.0           2.0      Test
13            29.0           2.0      Test
14            29.0           2.0      Test
15            29.0           2.0      Test
16            29.0           2.0      Test
...            ...           ...       ...
744612        31.0           3.0      Test
744613        31.0           3.0      Test
744614        31.0           3.0      Test
744627        49.0           2.0      Test
744628        49.0           2.0      Test

[176641 rows x 20 columns]

Unknown DataFrame:
        client_id             visitor_id                      visit_id  step  \
0             169  201385055_71273495308  749567106_99161211863_557568     4
1             169  201385055_71273495308  749567106_99161211863_557568     3
2             169  201385055_71273495308  749567106_99161211863_557568     2
3             169  201385055_71273495308  749567106_99161211863_557568     1
4             169  201385055_71273495308  749567106_99161211863_557568     0
...           ...                    ...                           ...   ...
744630    9999839  948322592_28990736246  715530422_68620416793_515645     3
744631    9999839  948322592_28990736246  715530422_68620416793_515645     2
744632    9999839  948322592_28990736246  715530422_68620416793_515645     1
744633    9999839  948322592_28990736246  715530422_68620416793_515645     0
744634    9999839  948322592_28990736246  715530422_68620416793_515645     0

                  date_time  tenure_years  tenure_months  age  gender  \
0       2017-04-12 20:23:09            21            262   47    Male
1       2017-04-12 20:22:05            21            262   47    Male
2       2017-04-12 20:20:31            21            262   47    Male
3       2017-04-12 20:19:45            21            262   47    Male
4       2017-04-12 20:19:36            21            262   47    Male
...                     ...           ...            ...  ...     ...
744630  2017-03-29 12:12:28            13            160   28  Female
744631  2017-03-29 12:11:50            13            160   28  Female
744632  2017-03-29 12:11:35            13            160   28  Female
744633  2017-03-29 12:11:32            13            160   28  Female
744634  2017-03-29 12:08:55            13            160   28  Female

        accounts    balance  calls_last_6_months  logons_last_6_months  \
0              2  501570.72                    4                     4
1              2  501570.72                    4                     4
2              2  501570.72                    4                     4
3              2  501570.72                    4                     4
4              2  501570.72                    4                     4
...          ...        ...                  ...                   ...
744630         2   67425.35                    3                     3
744631         2   67425.35                    3                     3
744632         2   67425.35                    3                     3
744633         2   67425.35                    3                     3
744634         2   67425.35                    3                     3

        stepped_back  error_count  client_tenure_years  client_tenure_months  \
0              False            4                 21.0                 262.0
1               True            4                 21.0                 262.0
2               True            4                 21.0                 262.0
3               True            4                 21.0                 262.0
4               True            4                 21.0                 262.0
...              ...          ...                  ...                   ...
744630          True            4                 13.0                 160.0
744631          True            4                 13.0                 160.0
744632          True            4                 13.0                 160.0
744633          True            4                 13.0                 160.0
744634         False            4                 13.0                 160.0

        client_age  num_accounts variation
0             47.0           2.0   Unknown
1             47.0           2.0   Unknown
2             47.0           2.0   Unknown
3             47.0           2.0   Unknown
4             47.0           2.0   Unknown
...            ...           ...       ...
744630        28.0           2.0   Unknown
744631        28.0           2.0   Unknown
744632        28.0           2.0   Unknown
744633        28.0           2.0   Unknown
744634        28.0           2.0   Unknown

[126649 rows x 20 columns]

In [91]:
control_variation_df.to_csv('control_variation_df.csv', index=False)
test_variation_df.to_csv('test_variation_df.csv', index=False)
unknown_variation_df.to_csv('unknown_variation_df.csv', index=False)